apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbdev.c
/****************************************************************************
 * arch/arm/src/lpc17xx_40xx/lpc17_40_usbdev.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "hardware/lpc17_40_usb.h"
#include "hardware/lpc17_40_syscon.h"
#include "lpc17_40_gpio.h"
#include "lpc17_40_gpdma.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#ifndef CONFIG_LPC17_40_USBDEV_EP0_MAXSIZE
#  define CONFIG_LPC17_40_USBDEV_EP0_MAXSIZE 64
#endif

#ifndef CONFIG_USBDEV_MAXPOWER
#  define CONFIG_USBDEV_MAXPOWER 100  /* mA */
#endif

#define USB_SLOW_INT USBDEV_INT_EPSLOW
#define USB_DEVSTATUS_INT USBDEV_INT_DEVSTAT

#ifdef CONFIG_LPC17_40_USBDEV_EPFAST_INTERRUPT
#  define USB_FAST_INT USBDEV_INT_EPFAST
#else
#  define USB_FAST_INT 0
#endif

/* Enable reading SOF from interrupt handler vs. simply reading on demand.
 * Probably a bad idea...
 * Unless there is some issue with sampling the SOF from hardware
 * asynchronously.
 */

#ifdef CONFIG_LPC17_40_USBDEV_FRAME_INTERRUPT
#  define USB_FRAME_INT USBDEV_INT_FRAME
#else
#  define USB_FRAME_INT 0
#endif

#ifdef CONFIG_DEBUG_USB
#  define USB_ERROR_INT USBDEV_INT_ERRINT
#else
#  define USB_ERROR_INT 0
#endif

#ifndef CONFIG_DEBUG_USB_INFO
#  undef  CONFIG_LPC17_40_USBDEV_REGDEBUG
#endif

/* CLKCTRL enable bits */

#define LPC17_40_CLKCTRL_ENABLES (USBDEV_CLK_DEVCLK|USBDEV_CLK_AHBCLK)

/* Dump GPIO registers */

#if defined(CONFIG_LPC17_40_USBDEV_REGDEBUG) && defined(CONFIG_DEBUG_GPIO_INFO)
#  define usbdev_dumpgpio() \
   do { \
     lpc17_40_dumpgpio(GPIO_USB_DP, "D+ P0.29; D- P0.30"); \
     lpc17_40_dumpgpio(GPIO_USB_VBUS, "LED P1:18; VBUS P1:30"); \
     lpc17_40_dumpgpio(GPIO_USB_CONNECT, "CONNECT P2:9"); \
   } while (0);
#else
#  define usbdev_dumpgpio()
#endif

/* Number of DMA descriptors */

#ifdef CONFIG_LPC17_40_USBDEV_DMA
# error DMA SUPPORT NOT YET FULLY IMPLEMENTED
#  ifndef CONFIG_LPC17_40_USBDEV_NDMADESCRIPTORS
#    define CONFIG_LPC17_40_USBDEV_NDMADESCRIPTORS 8
#  elif CONFIG_LPC17_40_USBDEV_NDMADESCRIPTORS > 30
#    define CONFIG_LPC17_40_USBDEV_NDMADESCRIPTORS 30
#  endif
#endif

/* Debug ********************************************************************/

/* Trace error codes */

#define LPC17_40_TRACEERR_ALLOCFAIL            0x0001
#define LPC17_40_TRACEERR_BADCLEARFEATURE      0x0002
#define LPC17_40_TRACEERR_BADDEVGETSTATUS      0x0003
#define LPC17_40_TRACEERR_BADEPNO              0x0004
#define LPC17_40_TRACEERR_BADEPGETSTATUS       0x0005
#define LPC17_40_TRACEERR_BADEPTYPE            0x0006
#define LPC17_40_TRACEERR_BADGETCONFIG         0x0007
#define LPC17_40_TRACEERR_BADGETSETDESC        0x0008
#define LPC17_40_TRACEERR_BADGETSTATUS         0x0009
#define LPC17_40_TRACEERR_BADSETADDRESS        0x000a
#define LPC17_40_TRACEERR_BADSETCONFIG         0x000b
#define LPC17_40_TRACEERR_BADSETFEATURE        0x000c
#define LPC17_40_TRACEERR_BINDFAILED           0x000d
#define LPC17_40_TRACEERR_DISPATCHSTALL        0x000e
#define LPC17_40_TRACEERR_DMABUSY              0x000f
#define LPC17_40_TRACEERR_DRIVER               0x0010
#define LPC17_40_TRACEERR_DRIVERREGISTERED     0x0011
#define LPC17_40_TRACEERR_EP0INSTALLED         0x0012
#define LPC17_40_TRACEERR_EP0OUTSTALLED        0x0013
#define LPC17_40_TRACEERR_EP0SETUPSTALLED      0x0014
#define LPC17_40_TRACEERR_EPINNULLPACKET       0x0015
#define LPC17_40_TRACEERR_EPOUTNULLPACKET      0x0016
#define LPC17_40_TRACEERR_EPREAD               0x0017
#define LPC17_40_TRACEERR_INVALIDCMD           0x0018
#define LPC17_40_TRACEERR_INVALIDCTRLREQ       0x0019
#define LPC17_40_TRACEERR_INVALIDPARMS         0x001a
#define LPC17_40_TRACEERR_IRQREGISTRATION      0x001b
#define LPC17_40_TRACEERR_NODMADESC            0x001c
#define LPC17_40_TRACEERR_NOEP                 0x001d
#define LPC17_40_TRACEERR_NOTCONFIGURED        0x001e
#define LPC17_40_TRACEERR_REQABORTED           0x001f

/* Trace interrupt codes */

#define LPC17_40_TRACEINTID_USB                0x0001
#define LPC17_40_TRACEINTID_CLEARFEATURE       0x0002
#define LPC17_40_TRACEINTID_CONNECTCHG         0x0003
#define LPC17_40_TRACEINTID_CONNECTED          0x0004
#define LPC17_40_TRACEINTID_DEVGETSTATUS       0x0005
#define LPC17_40_TRACEINTID_DEVRESET           0x0006
#define LPC17_40_TRACEINTID_DEVSTAT            0x0007
#define LPC17_40_TRACEINTID_DISCONNECTED       0x0008
#define LPC17_40_TRACEINTID_DISPATCH           0x0009
#define LPC17_40_TRACEINTID_EP0IN              0x000a
#define LPC17_40_TRACEINTID_EP0OUT             0x000b
#define LPC17_40_TRACEINTID_EP0SETUP           0x000c
#define LPC17_40_TRACEINTID_EPDMA              0x000d
#define LPC17_40_TRACEINTID_EPFAST             0x000e
#define LPC17_40_TRACEINTID_EPGETSTATUS        0x000f
#define LPC17_40_TRACEINTID_EPIN               0x0010
#define LPC17_40_TRACEINTID_EPINQEMPTY         0x0011
#define LPC17_40_TRACEINTID_EP0INSETADDRESS    0x0012
#define LPC17_40_TRACEINTID_EPOUT              0x0013
#define LPC17_40_TRACEINTID_EPOUTQEMPTY        0x0014
#define LPC17_40_TRACEINTID_EP0SETUPSETADDRESS 0x0015
#define LPC17_40_TRACEINTID_ERRINT             0x0016
#define LPC17_40_TRACEINTID_EPSLOW             0x0017
#define LPC17_40_TRACEINTID_FRAME              0x0018
#define LPC17_40_TRACEINTID_GETCONFIG          0x0019
#define LPC17_40_TRACEINTID_GETSETDESC         0x001a
#define LPC17_40_TRACEINTID_GETSETIF           0x001b
#define LPC17_40_TRACEINTID_GETSTATUS          0x001c
#define LPC17_40_TRACEINTID_IFGETSTATUS        0x001d
#define LPC17_40_TRACEINTID_SETCONFIG          0x001e
#define LPC17_40_TRACEINTID_SETFEATURE         0x001f
#define LPC17_40_TRACEINTID_SUSPENDCHG         0x0020
#define LPC17_40_TRACEINTID_SYNCHFRAME         0x0021

/* Hardware interface *******************************************************/

