apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbdev.c
/* Macros for testing the device status response */

#define DEVSTATUS_CONNECT(s)    (((s)&CMD_STATUS_CONNECT)!=0)
#define DEVSTATUS_CONNCHG(s)    (((s)&CMD_STATUS_CONNCHG)!=0)
#define DEVSTATUS_SUSPEND(s)    (((s)&CMD_STATUS_SUSPEND)!=0)
#define DEVSTATUS_SUSPCHG(s)    (((s)&CMD_STATUS_SUSPCHG)!=0)
#define DEVSTATUS_RESET(s)      (((s)&CMD_STATUS_RESET)!=0)

/* If this bit is set in the lpc17_40_epread response, it means that the
 * received packet was overwritten by a later setup packet (ep0 only).
 */

#define LPC17_40_READOVERRUN_BIT (0x80000000)
#define LPC17_40_READOVERRUN(s)  (((s) & LPC17_40_READOVERRUN_BIT) != 0)

/* Endpoints ****************************************************************/

/* Number of endpoints */

#define LPC17_40_NLOGENDPOINTS        (16)          /* ep0-15 */
#define LPC17_40_NPHYSENDPOINTS       (32)          /* x2 for IN and OUT */

/* Odd physical endpoint numbers are IN; even are out */

#define LPC17_40_EPPHYIN(epphy)       (((epphy)&1)!=0)
#define LPC17_40_EPPHYOUT(epphy)      (((epphy)&1)==0)

#define LPC17_40_EPPHYIN2LOG(epphy)   (((uint8_t)(epphy)>>1)|USB_DIR_IN)
#define LPC17_40_EPPHYOUT2LOG(epphy)  (((uint8_t)(epphy)>>1)|USB_DIR_OUT)

/* Each endpoint has somewhat different characteristics */

#define LPC17_40_EPALLSET             (0xffffffff)  /* All endpoints */
#define LPC17_40_EPOUTSET             (0x55555555)  /* Even phy endpoint numbers are OUT EPs */
#define LPC17_40_EPINSET              (0xaaaaaaaa)  /* Odd endpoint numbers are IN EPs */
#define LPC17_40_EPCTRLSET            (0x00000003)  /* EP0 IN/OUT are control endpoints */
#define LPC17_40_EPINTRSET            (0x0c30c30c)  /* Interrupt endpoints */
#define LPC17_40_EPBULKSET            (0xf0c30c30)  /* Bulk endpoints */
#define LPC17_40_EPISOCSET            (0x030c30c0)  /* Isochronous endpoints */
#define LPC17_40_EPDBLBUFFER          (0xf3cf3cf0)  /* Double buffered endpoints */

#define LPC17_40_EP0MAXPACKET         (64)          /* EP0 max packet size (1-64) */
#define LPC17_40_BULKMAXPACKET        (64)          /* Bulk endpoint max packet (8/16/32/64) */
#define LPC17_40_INTRMAXPACKET        (64)          /* Interrupt endpoint max packet (1 to 64) */
#define LPC17_40_ISOCMAXPACKET        (512)         /* Actually 1..1023 */

/* EP0 status.  EP0 transfers occur in a number of different contexts.  A
 * simple state machine is required to handle the various transfer complete
 * interrupt responses.  The following values are the various states:
 */

                                                    /* INTERRUPT CAUSE */
#define LPC17_40_EP0REQUEST           (0)           /* Normal request handling */
#define LPC17_40_EP0STATUSIN          (1)           /* Status sent */
#define LPC17_40_EP0STATUSOUT         (2)           /* Status received */
#define LPC17_40_EP0SHORTWRITE        (3)           /* Short data sent with no request */
#define LPC17_40_EP0SHORTWRSENT       (4)           /* Short data write complete */
#define LPC17_40_EP0SETADDRESS        (5)           /* Set address received */
#define LPC17_40_EP0WRITEREQUEST      (6)           /* EP0 write request sent */

/* Request queue operations *************************************************/

#define lpc17_40_rqempty(ep)          ((ep)->head == NULL)
#define lpc17_40_rqpeek(ep)           ((ep)->head)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* A container for a request so that the request make be retained in a list */

struct lpc17_40_req_s
{
  struct usbdev_req_s    req;            /* Standard USB request */
  struct lpc17_40_req_s  *flink;         /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

struct lpc17_40_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct lpc17_40_ep_s.
   */

  struct usbdev_ep_s      ep;            /* Standard endpoint structure */

  /* LPC17xx/LPC40xx-specific fields */

  struct lpc17_40_usbdev_s *dev;         /* Reference to private driver data */
  struct lpc17_40_req_s    *head;        /* Request list for this endpoint */
  struct lpc17_40_req_s    *tail;
  uint8_t                 epphy;         /* Physical EP address */
  uint8_t                 stalled:1;     /* 1: Endpoint is stalled */
  uint8_t                 halted:1;      /* 1: Endpoint feature halted */
  uint8_t                 txbusy:1;      /* 1: TX endpoint FIFO full */
  uint8_t                 txnullpkt:1;   /* Null packet needed at end of transfer */
};

/* This represents a DMA descriptor */

#ifdef CONFIG_LPC17_40_USBDEV_DMA
struct lpc17_40_dmadesc_s
{
  uint32_t                nextdesc;      /* Address of the next DMA descriptor in RAM */
  uint32_t                config;        /* Misc. bit encoded configuration information */
  uint32_t                start;         /* DMA start address */
  uint32_t                status;        /* Misc. bit encoded status information */
#ifdef CONFIG_USBDEV_ISOCHRONOUS
  uint32_t                size;          /* Isochronous packet size address */
#endif
};
#endif

/* This structure retains the state of the USB device controller */

struct lpc17_40_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s
   * to structlpc17_40_usbdev_s.
   */

  struct usbdev_s         usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* LPC17xx/LPC40xx-specific fields */

  uint8_t                 devstatus;     /* Last response to device status command */
  uint8_t                 ep0state;      /* State of certain EP0 operations */
  uint8_t                 paddr;         /* Address assigned by SETADDRESS */
  uint8_t                 stalled:1;     /* 1: Protocol stalled */
  uint8_t                 selfpowered:1; /* 1: Device is self powered */
  uint8_t                 paddrset:1;    /* 1: Peripheral addr has been set */
  uint8_t                 attached:1;    /* 1: Host attached */
  uint8_t                 rxpending:2;   /* 2: RX pending */
  uint32_t                softprio;      /* Bitset of high priority interrupts */
  uint32_t                epavail;       /* Bitset of available endpoints */
#ifdef CONFIG_LPC17_40_USBDEV_FRAME_INTERRUPT
  uint32_t                sof;           /* Last start-of-frame */
#endif

