apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbdev.c
  /* Allocated DMA descriptor */

#ifdef CONFIG_LPC17_40_USBDEV_DMA
  struct lpc17_40_dmadesc_s *dmadesc;
#endif

  /* The endpoint list */

  struct lpc17_40_ep_s     eplist[LPC17_40_NPHYSENDPOINTS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#ifdef CONFIG_LPC17_40_USBDEV_REGDEBUG
static void lpc17_40_printreg(uint32_t addr, uint32_t val, bool iswrite);
static void lpc17_40_checkreg(uint32_t addr, uint32_t val, bool iswrite);
static uint32_t lpc17_40_getreg(uint32_t addr);
static void lpc17_40_putreg(uint32_t val, uint32_t addr);
#else
#  define lpc17_40_getreg(addr)     getreg32(addr)
#  define lpc17_40_putreg(val,addr) putreg32(val,addr)
#endif

/* Command operations *******************************************************/

static uint32_t lpc17_40_usbcmd(uint16_t cmd, uint8_t data);

/* Request queue operations *************************************************/

static
struct lpc17_40_req_s *lpc17_40_rqdequeue(struct lpc17_40_ep_s *privep);
static void lpc17_40_rqenqueue(struct lpc17_40_ep_s *privep,
              struct lpc17_40_req_s *req);

/* Low level data transfers and request operations **************************/

static void lpc17_40_epwrite(uint8_t epphy,
                             const uint8_t *data, uint32_t nbytes);
static int  lpc17_40_epread(uint8_t epphy, uint8_t *data, uint32_t nbytes);
static inline void lpc17_40_abortrequest(struct lpc17_40_ep_s *privep,
              struct lpc17_40_req_s *privreq, int16_t result);
static void lpc17_40_reqcomplete(struct lpc17_40_ep_s *privep,
                                 int16_t result);
static int  lpc17_40_wrrequest(struct lpc17_40_ep_s *privep);
static int  lpc17_40_rdrequest(struct lpc17_40_ep_s *privep);
static void lpc17_40_cancelrequests(struct lpc17_40_ep_s *privep);

/* Interrupt handling *******************************************************/

static struct
lpc17_40_ep_s *lpc17_40_epfindbyaddr(struct lpc17_40_usbdev_s *priv,
                                     uint16_t eplog);
static void lpc17_40_eprealize(struct lpc17_40_ep_s *privep, bool prio,
                               uint32_t packetsize);
static uint8_t lpc17_40_epclrinterrupt(uint8_t epphy);
static inline void lpc17_40_ep0configure(struct lpc17_40_usbdev_s *priv);
#ifdef CONFIG_LPC17_40_USBDEV_DMA
static inline void lpc17_40_dmareset(uint32_t enable);
#endif
static void lpc17_40_usbreset(struct lpc17_40_usbdev_s *priv);
static void lpc17_40_dispatchrequest(struct lpc17_40_usbdev_s *priv,
              const struct usb_ctrlreq_s *ctrl);
static inline void lpc17_40_ep0setup(struct lpc17_40_usbdev_s *priv);
static inline
void lpc17_40_ep0dataoutinterrupt(struct lpc17_40_usbdev_s *priv);
static inline
void lpc17_40_ep0dataininterrupt(struct lpc17_40_usbdev_s *priv);
static int lpc17_40_usbinterrupt(int irq, void *context, void *arg);

#ifdef CONFIG_LPC17_40_USBDEV_DMA
static int  lpc17_40_dmasetup(struct lpc17_40_usbdev_s *priv, uint8_t epphy,
              uint32_t epmaxsize, uint32_t nbytes, uint32_t *isocpacket,
              bool isochronous);
static void lpc17_40_dmarestart(uint8_t epphy, uint32_t descndx);
static void lpc17_40_dmadisable(uint8_t epphy);
#endif /* CONFIG_LPC17_40_USBDEV_DMA */

/* Endpoint operations ******************************************************/

static int  lpc17_40_epconfigure(struct usbdev_ep_s *ep,
              const struct usb_epdesc_s *desc, bool last);
static int  lpc17_40_epdisable(struct usbdev_ep_s *ep);
static struct usbdev_req_s *lpc17_40_epallocreq(struct usbdev_ep_s *ep);
static void lpc17_40_epfreereq(struct usbdev_ep_s *ep,
              struct usbdev_req_s *);
#ifdef CONFIG_USBDEV_DMA
static void *lpc17_40_epallocbuffer(struct usbdev_ep_s *ep,
              uint16_t nbytes);
static void lpc17_40_epfreebuffer(struct usbdev_ep_s *ep, void *buf);
#endif
static int  lpc17_40_epsubmit(struct usbdev_ep_s *ep,
              struct usbdev_req_s *req);
static int  lpc17_40_epcancel(struct usbdev_ep_s *ep,
              struct usbdev_req_s *req);
static int  lpc17_40_epstall(struct usbdev_ep_s *ep, bool resume);

/* USB device controller operations *****************************************/

static struct usbdev_ep_s *lpc17_40_allocep(struct usbdev_s *dev,
              uint8_t epno, bool in, uint8_t eptype);
static void lpc17_40_freeep(struct usbdev_s *dev,
                            struct usbdev_ep_s *ep);
static int  lpc17_40_getframe(struct usbdev_s *dev);
static int  lpc17_40_wakeup(struct usbdev_s *dev);
static int  lpc17_40_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int  lpc17_40_pullup(struct usbdev_s *dev, bool enable);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct lpc17_40_usbdev_s g_usbdev;

static const struct usbdev_epops_s g_epops =
{
  .configure   = lpc17_40_epconfigure,
  .disable     = lpc17_40_epdisable,
  .allocreq    = lpc17_40_epallocreq,
  .freereq     = lpc17_40_epfreereq,
#ifdef CONFIG_USBDEV_DMA
  .allocbuffer = lpc17_40_epallocbuffer,
  .freebuffer  = lpc17_40_epfreebuffer,
#endif
  .submit      = lpc17_40_epsubmit,
  .cancel      = lpc17_40_epcancel,
  .stall       = lpc17_40_epstall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep     = lpc17_40_allocep,
  .freeep      = lpc17_40_freeep,
  .getframe    = lpc17_40_getframe,
  .wakeup      = lpc17_40_wakeup,
  .selfpowered = lpc17_40_selfpowered,
  .pullup      = lpc17_40_pullup,
};

/* USB Device Communication Area ********************************************
 *
 * The CPU and DMA controller communicate through a common area of memory,
 * called the USB Device Communication Area, or UDCA. The UDCA is a 32-word
 * array of DMA Descriptor Pointers (DDPs), each of which corresponds to a
 * physical endpoint. Each DDP points to the start address of a DMA
 * Descriptor, if one is defined for the endpoint. DDPs for unrealized
 * endpoints and endpoints disabled for DMA operation are ignored and can
 * be set to a NULL (0x0) value.
 *
 * The start address of the UDCA is stored in the USBUDCAH register. The UDCA
 * can reside at any 128-byte boundary of RAM that is accessible to both the
 * CPU and DMA controller (on other MCU's like the LPC2148, the UDCA lies in
 * a specialized 8Kb memory region).
 */

#ifdef CONFIG_LPC17_40_USBDEV_DMA
static uint32_t
g_udca[LPC17_40_NPHYSENDPOINTS] aligned_data(128);
static struct
lpc17_40_dmadesc_s  g_usbddesc[CONFIG_LPC17_40_USBDEV_NDMADESCRIPTORS];
#endif

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc17_40_printreg
 *
 * Description:
 *   Print the contents of an LPC17xx/LPC40xx register operation
 *
 ****************************************************************************/

#ifdef CONFIG_LPC17_40_USBDEV_REGDEBUG
static void lpc17_40_printreg(uint32_t addr, uint32_t val, bool iswrite)
{
  uinfo("%08x%s%08x\n", addr, iswrite ? "<-" : "->", val);
}
#endif

/****************************************************************************
 * Name: lpc17_40_checkreg
 *
 * Description:
 *   Get the contents of an LPC17xx/LPC40xx register
 *
 ****************************************************************************/

#ifdef CONFIG_LPC17_40_USBDEV_REGDEBUG
static void lpc17_40_checkreg(uint32_t addr, uint32_t val, bool iswrite)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;
  static bool     prevwrite = false;

  /* Is this the same value that we read from/wrote to the same register
   * last time? Are we polling the register?  If so, suppress the output.
   */

  if (addr == prevaddr && val == preval && prevwrite == iswrite)
    {
      /* Yes.. Just increment the count */

