apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbdev.c
  /* Handle the remaining */

  for (i = 1; i < LPC17_40_NPHYSENDPOINTS; i++)
    {
      privep = &priv->eplist[i];

      /* Same logical endpoint number? (includes direction bit) */

      if (eplog == privep->ep.eplog)
        {
          /* Return endpoint found */

          return privep;
        }
    }

  /* Return endpoint not found */

  return NULL;
}

/****************************************************************************
 * Name: lpc17_40_eprealize
 *
 * Description:
 *   Enable or disable an endpoint
 *
 ****************************************************************************/

static void lpc17_40_eprealize(struct lpc17_40_ep_s *privep,
                               bool prio, uint32_t packetsize)
{
  struct lpc17_40_usbdev_s *priv = privep->dev;
  uint32_t mask;
  uint32_t regval;

  /* Initialize endpoint software priority */

  mask = 1 << privep->epphy;
  if (prio)
    {
      priv->softprio = priv->softprio | mask;
    }
  else
    {
      priv->softprio = priv->softprio & ~mask;
    }

  /* Clear realize interrupt bit */

  lpc17_40_putreg(USBDEV_INT_EPRLZED, LPC17_40_USBDEV_INTCLR);

  /* Realize the endpoint */

  regval  = lpc17_40_getreg(LPC17_40_USBDEV_REEP);
  regval |= (1 << privep->epphy);
  lpc17_40_putreg(regval, LPC17_40_USBDEV_REEP);

  /* Set endpoint maximum packet size */

  lpc17_40_putreg(privep->epphy, LPC17_40_USBDEV_EPIND);
  lpc17_40_putreg(packetsize, LPC17_40_USBDEV_MAXPSIZE);

  /* Wait for Realize complete */

  while ((lpc17_40_getreg(LPC17_40_USBDEV_INTST) &
          USBDEV_INT_EPRLZED) == 0);

  /* Clear realize interrupt bit */

  lpc17_40_putreg(USBDEV_INT_EPRLZED, LPC17_40_USBDEV_INTCLR);
}

/****************************************************************************
 * Name: lpc17_40_epclrinterrupt
 *
 * Description:
 *   Clear the EP interrupt flag and return the current EP status
 *
 ****************************************************************************/

static uint8_t lpc17_40_epclrinterrupt(uint8_t epphy)
{
  /* Clear the endpoint interrupt */

  lpc17_40_putreg(1 << epphy, LPC17_40_USBDEV_EPINTCLR);

  /* Wait for data in the command data register */

  while ((lpc17_40_getreg(LPC17_40_USBDEV_INTST) & USBDEV_INT_CDFULL) == 0);

  /* Return the value of the command data register */

  return lpc17_40_getreg(LPC17_40_USBDEV_CMDDATA);
}

/****************************************************************************
 * Name: lpc17_40_ep0configure
 *
 * Description:
 *   Configure endpoint 0
 *
 ****************************************************************************/

static inline void lpc17_40_ep0configure(struct lpc17_40_usbdev_s *priv)
{
  uint32_t inten;

  /* EndPoint 0 initialization */

  lpc17_40_eprealize(&priv->eplist[LPC17_40_CTRLEP_OUT],
                     0, CONFIG_LPC17_40_USBDEV_EP0_MAXSIZE);
  lpc17_40_eprealize(&priv->eplist[LPC17_40_CTRLEP_IN],
                     1, CONFIG_LPC17_40_USBDEV_EP0_MAXSIZE);

  /* Enable EP0 interrupts (not DMA) */

  inten = lpc17_40_getreg(LPC17_40_USBDEV_EPINTEN);
  inten |= 3; /* EP0 Rx and Tx */
  lpc17_40_putreg(inten, LPC17_40_USBDEV_EPINTEN);
}

/****************************************************************************
 * Name: lpc17_40_dmareset
 *
 * Description: Reset USB DMA
 *
 ****************************************************************************/

#ifdef CONFIG_LPC17_40_USBDEV_DMA
static inline void lpc17_40_dmareset(uint32_t enable)
{
  int i;

  /* Disable All DMA interrupts */

  lpc17_40_putreg(0, LPC17_40_USBDEV_DMAINTEN);

  /* DMA Disable */

  lpc17_40_putreg(0xffffffff, LPC17_40_USBDEV_EPDMADIS);

  /* DMA Request clear */

  putreq32(0xffffffff, LPC17_40_USBDEV_DMARCLR);

  /* End of Transfer Interrupt Clear */

  putreq32(0xffffffff, LPC17_40_USBDEV_EOTINTCLR);

  /* New DD Request Interrupt Clear */

  putreq32(0xffffffff, LPC17_40_USBDEV_NDDRINTCLR);

  /* System Error Interrupt Clear */

  putreq32(0xffffffff, LPC17_40_USBDEV_SYSERRINTCLR);

  /* Nullify all pointers in the UDCA */

  for (i = 0; i < LPC17_40_NPHYSENDPOINTS; ++i)
    {
      g_udca[i] = NULL;
    }

  /* Set USB UDCA Head register */

  lpc17_40_putreg((uint32_t)g_udca, LPC17_40_USBDEV_UDCAH);

  /* Invalidate all DMA descriptors */

  for (i = 0; i < CONFIG_LPC17_40_USBDEV_NDMADESCRIPTORS; ++i)
    {
      memset(&g_usbddesc[i], 0, sizeof(struct lpc17_40_dmadesc_s));
    }

  /* Enable DMA interrupts */

  lpc17_40_putreg(enable, LPC17_40_USBDEV_DMAINTEN);
}
#endif

/****************************************************************************
 * Name: lpc17_40_usbreset
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void lpc17_40_usbreset(struct lpc17_40_usbdev_s *priv)
{
  /* Disable all endpoint interrupts */

  lpc17_40_putreg(0, LPC17_40_USBDEV_EPINTEN);

  /* Frame is Hp interrupt */

  lpc17_40_putreg(USBDEV_INT_FRAME, LPC17_40_USBDEV_INTPRI);

  /* Clear all pending interrupts */

  lpc17_40_putreg(0xffffffff, LPC17_40_USBDEV_EPINTCLR);
  lpc17_40_putreg(0xffffffff, LPC17_40_USBDEV_INTCLR);

  /* Periperhal address is needed */

  priv->paddrset = 0;

  /* Endpoints not yet configured */

  lpc17_40_usbcmd(CMD_USBDEV_CONFIG, 0);

  /* EndPoint 0 initialization */

  lpc17_40_ep0configure(priv);

#ifdef CONFIG_LPC17_40_USBDEV_DMA
  /* Enable End_of_Transfer_Interrupt and System_Error_Interrupt USB DMA
   * interrupts
   */

  lpc17_40_dmareset(CONFIG_LPC17_40_USBDEV_DMAINT_MASK);

#endif

  /* Enable Device interrupts */

  lpc17_40_putreg(USB_SLOW_INT | USB_DEVSTATUS_INT | USB_FAST_INT |
               USB_FRAME_INT | USB_ERROR_INT,
               LPC17_40_USBDEV_INTEN);

  /* Tell the class driver that we are disconnected. The class
   * driver should then accept any new configurations.
   */

  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }
}

/****************************************************************************
 * Name: lpc17_40_dispatchrequest
 *
 * Description:
 *   Provide unhandled setup actions to the class driver.
 *   This is logically part of the USB interrupt handler.
 *
 ****************************************************************************/

static void lpc17_40_dispatchrequest(struct lpc17_40_usbdev_s *priv,
                                    const struct usb_ctrlreq_s *ctrl)
{
  int ret;

