apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbdev.c
        lpc17_40_rdrequest(&priv->eplist[LPC17_40_EP0_OUT]);
      }
      break;

    default:
      priv->stalled = 1;
      break;
    }

  if (priv->stalled)
    {
      usbtrace(TRACE_DEVERROR(LPC17_40_TRACEERR_EP0OUTSTALLED),
                              priv->ep0state);
      lpc17_40_epstall(&priv->eplist[LPC17_40_EP0_IN].ep, false);
      lpc17_40_epstall(&priv->eplist[LPC17_40_EP0_OUT].ep, false);
    }
}

/****************************************************************************
 * Name: lpc17_40_ep0dataininterrupt
 *
 * Description:
 *   USB Ctrl EP Data IN Event. This is logically part of the USB interrupt
 *   handler.  All non-isochronous IN endpoints give this interrupt when a
 *   packet is successfully transmitted (OR a NAK handshake is sent on the
 *   bus provided that the interrupt on NAK feature is enabled).
 *
 ****************************************************************************/

static inline
void lpc17_40_ep0dataininterrupt(struct lpc17_40_usbdev_s *priv)
{
  struct lpc17_40_ep_s *ep0;

  switch (priv->ep0state)
    {
    case LPC17_40_EP0STATUSOUT:
    case LPC17_40_EP0STATUSIN:
      priv->ep0state = LPC17_40_EP0REQUEST;
      break;

    case LPC17_40_EP0SHORTWRITE:
      priv->ep0state = LPC17_40_EP0SHORTWRSENT;
      break;

    case LPC17_40_EP0SETADDRESS:
      {
        /* If the address was set to a non-zero value, then
         * thiscompletes the default phase,
         * and begins the address phase
         * (still not fully configured)
         */

        usbtrace(TRACE_INTDECODE(LPC17_40_TRACEINTID_EP0INSETADDRESS),
                                (uint16_t)priv->paddr);
        lpc17_40_usbcmd(CMD_USBDEV_CONFIG, 0);
        if (priv->paddr)
          {
            priv->paddrset = 1;
            priv->ep0state = LPC17_40_EP0REQUEST;
          }
      }
      break;

    case LPC17_40_EP0REQUEST:
      {
        /* Process the next request action (if any) */

        ep0 = &priv->eplist[LPC17_40_EP0_IN];
        ep0->txbusy = 0;
        lpc17_40_wrrequest(ep0);
      }
      break;

    default:
      priv->stalled = 1;
      break;
    }

  if (priv->stalled)
    {
      usbtrace(TRACE_DEVERROR(LPC17_40_TRACEERR_EP0INSTALLED),
                              priv->ep0state);
      lpc17_40_epstall(&priv->eplist[LPC17_40_EP0_IN].ep, false);
      lpc17_40_epstall(&priv->eplist[LPC17_40_EP0_OUT].ep, false);
    }
}

/****************************************************************************
 * Name: lpc17_40_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int lpc17_40_usbinterrupt(int irq, void *context, void *arg)
{
  struct lpc17_40_usbdev_s *priv = &g_usbdev;
  struct lpc17_40_ep_s *privep ;

  uint32_t devintstatus;  /* Sampled state of the device interrupt status register */
  uint32_t epintstatus;   /* Sampled state of the endpoint interrupt status register */
#ifdef CONFIG_LPC17_40_USBDEV_DMA
  uint32_t usbintstatus;  /* Sampled state is SYSCON USB interrupt status */
  uint32_t dmaintstatus;  /* Sampled state of dma interrupt status register */
#endif
  uint32_t softprio;      /* Current priority interrupt bitset */
  uint32_t pending;       /* Pending subset of priority interrupt bitset */
  uint8_t  epphy;         /* Physical endpoint number being processed */
  int      i;

  /* Read the device interrupt status register */

  devintstatus = lpc17_40_getreg(LPC17_40_USBDEV_INTST);
  usbtrace(TRACE_INTENTRY(LPC17_40_TRACEINTID_USB),
                         (uint16_t)devintstatus);

#ifdef CONFIG_LPC17_40_USBDEV_DMA
  /* Check for low priority and high priority (non-DMA) interrupts */

  usbintstatus = lpc17_40_getreg(LPC17_40_SYSCON_USBINTST);
  if ((usbintstatus &
      (SYSCON_USBINTST_REQLP | SYSCON_USBINTST_REQHP)) != 0)
    {
#endif
#ifdef CONFIG_LPC17_40_USBDEV_EPFAST_INTERRUPT
      /* Fast EP interrupt */

      if ((devintstatus & USBDEV_INT_EPFAST) != 0)
        {
          /* Clear Fast EP interrupt */

          lpc17_40_putreg(USBDEV_INT_EPFAST, LPC17_40_USBDEV_INTCLR);
          usbtrace(TRACE_INTDECODE(LPC17_40_TRACEINTID_EPFAST), 0);

          /* Do what? */
        }

#endif

#ifdef CONFIG_DEBUG_USB
      /* USB engine error interrupt */

      if ((devintstatus & USBDEV_INT_ERRINT) != 0)
        {
          uint8_t errcode;

          /* Clear the error interrupt */

          lpc17_40_putreg(USBDEV_INT_ERRINT, LPC17_40_USBDEV_INTCLR);

          /* And show what error occurred */

          errcode = (uint8_t)lpc17_40_usbcmd(CMD_USBDEV_READERRORSTATUS, 0) &
                     CMD_READERRORSTATUS_ALLERRS;
          usbtrace(TRACE_INTDECODE(LPC17_40_TRACEINTID_ERRINT),
                                  (uint16_t)errcode);
        }
#endif

#ifdef CONFIG_LPC17_40_USBDEV_FRAME_INTERRUPT
      /* Frame interrupt */

      if ((devintstatus & USBDEV_INT_FRAME) != 0)
        {
          /* Clear the frame interrupt */

          lpc17_40_putreg(USBDEV_INT_FRAME, LPC17_40_USBDEV_INTCLR);
          usbtrace(TRACE_INTDECODE(LPC17_40_TRACEINTID_FRAME), 0);

          /* Then read the start of frame value */

          priv->sof = (uint16_t)lpc17_40_usbcmd(CMD_USBDEV_READFRAMENO, 0);
        }
#endif

      /* Device Status interrupt */

      if ((devintstatus & USBDEV_INT_DEVSTAT) != 0)
        {
          /* Clear Device status interrupt */

          lpc17_40_putreg(USBDEV_INT_DEVSTAT, LPC17_40_USBDEV_INTCLR);

          /* Get device status */

          g_usbdev.devstatus = (uint8_t)lpc17_40_usbcmd(
                                        CMD_USBDEV_GETSTATUS, 0);
          usbtrace(TRACE_INTDECODE(LPC17_40_TRACEINTID_DEVSTAT),
                  (uint16_t)g_usbdev.devstatus);

          /* Device connection status */

          if (DEVSTATUS_CONNCHG(g_usbdev.devstatus))
            {
              usbtrace(TRACE_INTDECODE(LPC17_40_TRACEINTID_CONNECTCHG),
                       (uint16_t)g_usbdev.devstatus);
              if (DEVSTATUS_CONNECT(g_usbdev.devstatus))
                {
                  /* Host is connected */

                  if (!priv->attached)
                    {
                      /* We have a transition from unattached to attached */

