apache/nuttx/arch/arm/src/lpc17xx_40xx/lpc17_40_usbdev.c
                              usbtrace(TRACE_INTDECODE(
                                       LPC17_40_TRACEINTID_EPIN),
                                       (uint16_t)epphy);

                              /* Read host data into the current read
                               * request
                               */

                              if (!lpc17_40_rqempty(privep))
                                {
                                  lpc17_40_rdrequest(privep);
                                }
                              else
                                {
                                  uinfo("Pending data on OUT endpoint\n");
                                  DEBUGASSERT(priv->rxpending < 3);
                                  priv->rxpending++;
                                }
                            }
                        }
                    }
                }
            }
          while (epintstatus);
        }
#ifdef CONFIG_LPC17_40_USBDEV_DMA
    }

  /* Check for DMA interrupts */

  if ((usbintstatus & SYSCON_USBINTST_REQDMA) != 0)
    {
      /* First Software High priority and then low priority */

      uint32_t tmp;

      /* Collect the DMA interrupt sources */

      dmaintstatus = 0;
      tmp = lpc17_40_getreg(LPC17_40_USBDEV_EOTINTST);
      if (lpc17_40_getreg(LPC17_40_USBDEV_DMAINTEN) & 1)
        {
          dmaintstatus |= tmp;
        }

      lpc17_40_putreg(tmp, LPC17_40_USBDEV_EOTINTCLR);

      tmp = lpc17_40_getreg(LPC17_40_USBDEV_NDDRINTST);
      if (lpc17_40_getreg(LPC17_40_USBDEV_DMAINTEN) & 2)
        {
          dmaintstatus |= tmp;
        }

      lpc17_40_putreg(tmp, LPC17_40_USBDEV_NDDRINTCLR);

      tmp = lpc17_40_getreg(LPC17_40_USBDEV_SYSERRINTST);
      if (lpc17_40_getreg(LPC17_40_USBDEV_DMAINTEN) & 4)
        {
          dmaintstatus |= tmp;
        }

      lpc17_40_putreg(tmp, LPC17_40_USBDEV_SYSERRINTCLR);

      /* Loop twice:  Process software high priority interrupts on the
       * first pass and low priority interrupts on the second.
       */

      softprio = priv->softprio;
      for (i = 0; i < 2; i++, softprio = ~softprio)
        {
          /* On the first time through the loop, pending will be
           * the bitset of high priority pending interrupts; on the
           * second time through it will be the bitset of low
           * priority interrupts. Note that EP0 IN and OUT are
           * omitted.
           */

          pending = (dmaintstatus & softprio) >> 2;
          for (epphy = 2; pending; epphy++, pending >>= 1)
            {
              if ((pending & 1) != 0)
                {
                  usbtrace(TRACE_INTDECODE(LPC17_40_TRACEINTID_EPDMA),
                          (uint16_t)epphy);
#warning DO WHAT?
                }
            }
        }
    }
#endif

  usbtrace(TRACE_INTEXIT(LPC17_40_TRACEINTID_USB), 0);
  return OK;
}

/****************************************************************************
 * Name: lpc17_40_dmasetup
 *
 * Description:
 *   Setup for DMA Transfer
 *
 ****************************************************************************/

#ifdef CONFIG_LPC17_40_USBDEV_DMA
static int lpc17_40_dmasetup(struct lpc17_40_usbdev_s *priv,
                             uint8_t epphy,
                             uint32_t epmaxsize, uint32_t nbytes,
                             uint32_t *isocpacket,
                             bool isochronous);
{
  struct lpc17_40_dmadesc_s *dmadesc = priv;
  uint32_t regval;

#ifdef CONFIG_DEBUG_USB
  if (!priv || epphy < 2)
    {
      usbtrace(TRACE_DEVERROR(LPC17_40_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  /* Check if a DMA descriptor has been assigned. If not, than that indicates
   * that we will have to do parallel I/O
   */

  if (!dmadesc)
    {
      usbtrace(TRACE_DEVERROR(LPC17_40_TRACEERR_NODMADESC), 0);
      return -EBUSY;
    }

  /* Verify that the DMA descriptor is available */

  if ((dmadesc->status & USB_DMADESC_STATUS_MASK) ==
       USB_DMADESC_BEINGSERVICED)
    {
      usbtrace(TRACE_DEVERROR(LPC17_40_TRACEERR_DMABUSY), 0);
      return -EBUSY; /* Shouldn't happen */
    }

  /* Init DMA Descriptor */

  dmadesc->nexdesc = 0;
  dmadesc->config  = USB_DMADESC_MODENORMAL |
                     ((epmaxsize << USB_DMADESC_PKTSIZE_SHIFT) &
                      USB_DMADESC_PKTSIZE_MASK) |
                     ((nbytes << USB_DMADESC_BUFLEN_SHIFT) &
                      USB_DMADESC_BUFLEN_MASK);

#ifdef CONFIG_USBDEV_ISOCHRONOUS
  if (isochronous)
    {
      dmadesc->config |= USB_DMADESC_ISCOEP;
    }
#endif

  dmadesc->start = (uint32_t)&dmadesc->buffer;
  dmadesc->status = 0;

#ifdef CONFIG_USBDEV_ISOCHRONOUS
  dmadesc->size = (uint32_t)packet;
#endif

  /* Enable DMA transfer for this endpoint */

  putreq32(1 << epphy, LPC17_40_USBDEV_EPDMAEN);

  /* Check state of IN/OUT Ep buffer */

  regval = lpc17_40_usbcmd(CMD_USBDEV_EPSELECT | epphy, 0);

  if ((LPC17_40_EPPHYIN(epphy) &&  (regval & 0x60) == 0) ||
      (LPC17_40_EPPHYOUT(epphy) &&  (regval & 0x60) == 0x60))
    {
      /* DMA should be "being serviced" */

      if ((dmadesc->status & USB_DMADESC_STATUS_MASK) !=
           USB_DMADESC_BEINGSERVICED)
        {
          /* Re-trigger the DMA Transfer */

          putreq32(1 << epphy, LPC17_40_USBDEV_DMARCLR);
          putreq32(1 << epphy, LPC17_40_USBDEV_EPDMAEN);
        }
    }

  return OK;
}
#endif /* CONFIG_LPC17_40_USBDEV_DMA */

/****************************************************************************
 * Name: lpc17_40_dmarestart
 *
 * Description:
 *   Restart DMA Transfer
 *
 ****************************************************************************/

#ifdef CONFIG_LPC17_40_USBDEV_DMA
static void lpc17_40_dmarestart(uint8_t epphy, uint32_t descndx)
{
  uint32_t regval;

  /* Clear DMA descriptor status */

  g_usbddesc[descndx].status = 0;

  /* Enable DMA transfer on the endpoint */

  lpc17_40_putreg(1 << epph, LPC17_40_USBDEV_EPDMAEN);

  /* Check the state of IN/OUT EP buffer */

  uint32_t regval = lpc17_40_usbcmd(CMD_USBDEV_EPSELECT | epphy, 0);
  if ((LPC17_40_EPPHYIN(epphy) &&  (regval & 0x60) == 0) ||
      (LPC17_40_EPPHYIN(epphy) &&  (regval & 0x60) == 0x60))
    {
      /* Re-trigger the DMA Transfer */

      putreq32(1 << epphy, LPC17_40_USBDEV_DMARCLR);
      putreq32(1 << epphy, LPC17_40_USBDEV_EPDMAEN);
    }
}
#endif /* CONFIG_LPC17_40_USBDEV_DMA */

/****************************************************************************
 * Name: lpc17_40_dmadisable
 *
 * Description:
 *   Disable DMA transfer for the EP
 *
 ****************************************************************************/

#ifdef CONFIG_LPC17_40_USBDEV_DMA
static void lpc17_40_dmadisable(uint8_t epphy)
{
  EPDMADIS = 1 << epphy;
}
#endif /* CONFIG_LPC17_40_USBDEV_DMA */

/****************************************************************************
 * Endpoint operations
 ****************************************************************************/

/****************************************************************************
 * Name: lpc17_40_epconfigure
 *
 * Description:
 *   Configure endpoint, making it usable
 *
 * Input Parameters:
 *   ep   - the struct usbdev_ep_s instance obtained from allocep()
 *   desc - A struct usb_epdesc_s instance describing the endpoint
 *   last - true if this this last endpoint to be configured.  Some hardware
 *          needs to take special action when all of the endpoints have been
 *          configured.
 *
 ****************************************************************************/

static int lpc17_40_epconfigure(struct usbdev_ep_s *ep,
                                const struct usb_epdesc_s *desc,
                                bool last)
{
  struct lpc17_40_ep_s *privep = (struct lpc17_40_ep_s *)ep;
  uint32_t inten;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);
  DEBUGASSERT(desc->addr == ep->eplog);

